app/controllers/home_controller.rb

  def index
  	@newsitems = Newsitem.all
---
SELECT * FROM `newsitems`