app/controllers/newsitems_controller.rb

INSERT INTO `newsitems` (`created_at`, `title`, `body`) VALUES('2010-05-04 07:32:48', 'test', '<p>hello</p>\r\n<ul>\r\n<li>these</li>\r\n<li>are</li>\r\n<li>bullets</li>\r\n</ul>')
---
  def new_news
  	@newsitem = Newsitem.new

  	if request.post?
  		@newsitem = Newsitem.new(params[:newsitem])
  		@newsitem.created_at = Time.now

SELECT * FROM `newsitems` WHERE (`newsitems`.`n_id` = '1') LIMIT 1
DELETE FROM `newsitems` WHERE `n_id` = 1
---
  def delete
  	item = Newsitem.find(:first, :conditions => { :n_id => params[:id] })
  	if item.destroy

SELECT * FROM `newsitems` WHERE (`newsitems`.`n_id` = '4') LIMIT 1
UPDATE `newsitems` SET `title` = 'testttterrr' WHERE `n_id` = 4
---
  def edit
  	@newsitem = Newsitem.find(:first, :conditions => { :n_id => params[:id] })

  	if request.put? && @newsitem.update_attributes(params[:newsitem])